{
  "title": "Shadows Below The Marsh",
  "description": "Captured and on the run for days, you and your captors traverse a foreboding marsh, driven by an unspoken terror nipping at their heels. Suddenly, the group stumbles upon a peculiar portal rising from the murky waters, and with an air of urgency, they open it magically. Chaos ensues as a horde of enraged tribal warriors descends upon your party. Seizing the opportunity, you snatch a fallen dagger, slice through your bindings, and hastily descend a ladder into the ominous depths below, sealing the portal with a decisive [b]click[/b]. \nAs the lid closes, you realize the gravity of your situation – free from captivity but thrust into an unknown darkness. \n[i](Your journey as an adventurer begins on a precarious note.)[/i]",
  "cover": "DONT NEED TO DO THIS - WE CAN JUST SAVE 0-0.JPG IN IMAGES AS THE INITIAL COVER IMAGE",
  "maparraysComments": "Each level can have 30 rooms (game ui has 6 rows of 5) - 5x5 squares so 25x25 feet, each level needs to start with the level number and the room number... game keeps track of where the player is and shows the map room they are in as well as all the map rooms they have been in before",
  "maparrays": [
    "1-25, 1-20, 1-18, 1-24, 1-23,   1-22, 1-21, 1-19, 1-2, 1-17,   na, 1-16, 1-15, 1-1, 1-3",
    "2-25, 2-20, 2-18, 2-24, 2-23, 2-22, 2-21, 2-19, 2-18, 2-17, na, 2-16, 2-15, 2-1, 2-2",
    "3-25, 3-20, 3-18, 3-24, 3-23, 3-22, 3-21, 3-19, 3-18, 3-17, na, 3-16, 3-15, 3-1, 3-2"
  ],
  "rooms": [
    {
      "roomId": "1-1",
      "title": "Start",
      "description": "You drop down from above, almost twisting your ankle on the stone floor below.  You look around and are startled to discover lit torches...  This room is 10' x 10' covered in dust and ancient looking.  In the corner you see a withered skeleton holding a rusty shortsword and a chest in the corner.",
      "roomImage": "1-1",
      "exits": [
        {
          "directionAction": "north",
          "roomId": "1-2"
        },
        {
          "directionAction": "east",
          "roomId": "1-3"
        }
      ],
      "items": [
        {
          "type": "weapon",
          "name": "Shortsword",
          "description": "A rusty worn shortsword.",
          "condition": "worn"
        },
        {
          "type": "moneypile",
          "name": "2 silver pieces",
          "description": "2 silver pieces",
          "value": 0.2
        }
      ]
    },
    {
      "roomId": "1-2",
      "title": "The Path",
      "description": "You are on a path. The path is muddy. You can see a marsh to the south and a cave to the north.",
      "roomImage": "1-2",
      "exits": [
        {
          "directionAction": "south",
          "roomId": "1-1"
        },
        {
          "directionAction": "east",
          "roomId": "1-2"
        },
        {
          "directionAction": "east",
          "roomId": "1-2"
        }
      ],
      "items": [
        {
          "name": "rope",
          "description": "A rusty sword.",
          "weight": 1,
          "goldvalue": 5
        }
      ]
    }
  ]
}